src/DataProcessors/Web1C_ЭкспортФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>Web1C_ЭкспортФайлов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/Web1C_ВидыРесурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>Web1C_ВидыРесурса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скрипт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Web1C_HTMLОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>Web1C_HTMLОбъекты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изображения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стили</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скрипты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Web1C_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Web1C_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Web1C_ВидыРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийФайл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВСетевуюПапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовыйФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/Web1C_ЭкспортФайлов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыгружатьИзображения = Истина;
	ВыгружатьСкрипты = Истина;
	ВыгружатьСтили = Истина;
	ВыгружатьФайлы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОбъектыДляЭкспорта(Команда)
	ПодобратьОбъектыДляЭкспортаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодобратьОбъектыДляЭкспортаНаСервере()
	ОбъектыДляЭкспорта.Очистить();
	Индекс = 1;
	Если ВыгружатьИзображения Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Изображение"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Изображения"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 0;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если ВыгружатьФайлы Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Файл"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Файлы"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 1;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если ВыгружатьСкрипты Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Скрипт"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Скрипты"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 2;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если ВыгружатьСтили Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Стиль"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Стили"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 3;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортФайловКоманда(Команда)
	ЭкспортФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортФайлов()
	Для каждого ТекСтрока Из ОбъектыДляЭкспорта Цикл
		Если ТекСтрока.Тип = 0 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортИзображенияВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		ИначеЕсли ТекСтрока.Тип = 1 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортФайлаВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		ИначеЕсли ТекСтрока.Тип = 2 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортСкриптаВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		ИначеЕсли ТекСтрока.Тип = 3 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортСтиляВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
